Raw-wrk-files/run-3/json/silex-raw/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Mon Oct 21 19:55:12 PDT 2013

  System load:  0.0                Processes:           120
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 3%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

64 packages can be updated.
24 updates are security updates.


---------------------------------------------------------
 Running Primer silex-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://tfbapp:8080/json
---------------------------------------------------------

Running 5s test @ http://tfbapp:8080/json
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.04ms    1.28ms  12.51ms   75.34%
    Req/Sec   353.13     77.08   583.00     63.90%
  13240 requests in 5.00s, 3.14MB read
Requests/sec:   2647.02
Transfer/sec:    643.53KB

---------------------------------------------------------
 Running Warmup silex-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    88.65ms  170.12ms   3.70s    97.38%
    Req/Sec   366.35     56.73   555.00     73.78%
  43961 requests in 15.01s, 10.44MB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:   2929.74
Transfer/sec:    712.31KB

---------------------------------------------------------
 Concurrency: 8 for silex-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 8 -t 8 http://tfbapp:8080/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.08ms    1.27ms  13.16ms   72.35%
    Req/Sec   356.65     89.62   666.00     78.95%
  40603 requests in 15.00s, 9.64MB read
Requests/sec:   2706.56
Transfer/sec:    658.01KB

---------------------------------------------------------
 Concurrency: 16 for silex-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 16 -t 8 http://tfbapp:8080/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.88ms    4.73ms  76.18ms   87.71%
    Req/Sec   370.90    102.81   736.00     68.82%
  43494 requests in 15.01s, 10.33MB read
Requests/sec:   2898.61
Transfer/sec:    704.70KB

---------------------------------------------------------
 Concurrency: 32 for silex-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 32 -t 8 http://tfbapp:8080/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json
  8 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.90ms   20.96ms 340.37ms   91.91%
    Req/Sec   367.05    110.60   709.00     68.48%
  43746 requests in 15.00s, 10.39MB read
Requests/sec:   2915.82
Transfer/sec:    708.89KB

---------------------------------------------------------
 Concurrency: 64 for silex-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 64 -t 8 http://tfbapp:8080/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json
  8 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.02ms   64.80ms 957.09ms   94.16%
    Req/Sec   368.62    130.26     1.10k    68.97%
  43818 requests in 15.00s, 10.40MB read
Requests/sec:   2920.71
Transfer/sec:    710.08KB

---------------------------------------------------------
 Concurrency: 128 for silex-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 128 -t 8 http://tfbapp:8080/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.67ms   61.06ms 640.08ms   88.76%
    Req/Sec   370.53     76.99   642.00     68.29%
  44422 requests in 15.01s, 10.55MB read
Requests/sec:   2960.15
Transfer/sec:    719.68KB

---------------------------------------------------------
 Concurrency: 256 for silex-raw
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 256 -t 8 http://tfbapp:8080/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.26ms  116.08ms   1.25s    90.94%
    Req/Sec   364.62     28.84   452.00     72.88%
  43738 requests in 15.01s, 10.38MB read
Requests/sec:   2914.53
Transfer/sec:    708.62KB